using System;

namespace Building
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:
            //•	На всеки четен етаж има само офиси
            //•	На всеки нечетен етаж има само апартаменти
            //•	Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0.
            //•	Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0.
            //•	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
            //От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.

            int countOfFloors = int.Parse(Console.ReadLine());
            int countOfRooms = int.Parse(Console.ReadLine());

            for (int i = countOfFloors; i > 0; i--)
            {
                for (int a = 0; a < countOfRooms; a++)
                {
                    if (i == countOfFloors)
                    {
                        Console.Write($"L{i}{a} ");
                    }
                    else if (i % 2 == 0)
                    {
                        Console.Write($"O{i}{a} ");
                    }
                    else
                    {
                        Console.Write($"A{i}{a} ");
                    }
                }
                Console.WriteLine();
            }

        }
    }
}
