using System;
using System.Xml.Linq;

namespace SafePasswordsGenerator
{
    class Program
    {
        static void Main(string[] args)
        {
            //Ани се страхува от това, да не й бъде хакнат някой от профилите в социалните мрежи, затова решава да направи генератор за пароли, които да бъдат достатъчно сигурни. Вашата задача е да й помогнете да напише програма, която ще генерира тези пароли, разделени една от друга от знака "|".
            //Да се напише програма, която генерира серия от символи като в шаблона:
            //ABxyBA 
            //като при всяко генериране на нов код, стойностите на символите се увеличават с 1. Ако A надхвърли 55, се връща на 35. Ако B надхвърли 96, се връща на 64.
            int a = 35;
            int b = 64;
            //•	На първия ред a – цяло число в интервала [1 … 1000]
            int maxForX = int.Parse(Console.ReadLine());
            //•	На втория ред b – цяло число в интервала [1 … 1000]
            int maxForY = int.Parse(Console.ReadLine());
            //•	На третия ред максимален брой генерирани пароли – цяло число в интервала [1 … 1000000]
            int maxCountOfPasswords = int.Parse(Console.ReadLine());

            //Ограничения:
            //•	A е символ с ASCII стойност в диапазона [35… 55]
            //•	B е символ с ASCII стойност в диапазона [64 … 96]
            //•	x e цяло число в диапазона [1… a] 
            //•	y e цяло число в диапазона [1… b] 

            for (int x = 1; x <= maxForX; x++)
            {
                for (int y = 1; y <= maxForY; y++)
                {
                    if (maxCountOfPasswords > 0)
                    {
                        if (a > 55)
                        {
                            a = 35;
                        }
                        if (b > 96)
                        {
                            b = 64;
                        }
                        Console.Write($"{(char)a}{(char)b}{x}{y}{(char)b}{(char)a}|");
                        a++;
                        b++;
                        maxCountOfPasswords--;
                    }
                    else
                    {
                        break;
                    }
                }
                if (maxCountOfPasswords <= 0)
                {
                    break;
                }
            }

            //Да се отпечата на конзолата:
            //•	Генерираният код. Ако броят на комбинациите е по-голям от максималния на кода, да се отпечата до подадената стойност, в противен случай да се отпечата до текущия брой на комбинациите.

        }
    }
}
